-- Nome da migração: V003__Populate_Table_Medico.sql

INSERT INTO tb_medico (id, created_at, updated_at, ativo, cpf, crm, email, especialidade_medica, first_name, last_name, telefone)
VALUES
    ('3a9df45e-24cd-4a5b-b531-438e4e8f3e84', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '123.456.789-00', 'CRM12345', 'medico1@example.com', 1, 'João', 'Silva', '(16) 98765-4321'),
    ('a740bb02-9f71-4d6c-91b7-512c245aa45c', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '987.654.321-99', 'CRM54321', 'medico2@example.com', 2, 'Maria', 'Souza', '(16) 12345-6789'),
    ('52ed6b9a-5e2e-42f1-8847-55f39e6e6664', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '111.222.333-44', 'CRM67890', 'medico3@example.com', 3, 'Pedro', 'Santos', '(16) 55555-5555'),
    ('9c1d5ff5-c63e-49f7-8d36-02fcb44b1974', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '555.555.555-55', 'CRM09876', 'medico4@example.com', 4, 'Ana', 'Oliveira', '(16) 99999-9999'),
    ('8d8a74fe-5084-4edf-a16c-eb6e1357ed79', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '999.888.777-66', 'CRM76543', 'medico5@example.com', 5, 'Fernando', 'Lima', '(16) 11111-1111'),
    ('e3843be4-28c3-4394-b860-ae26a34a7d48', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '777.888.999-00', 'CRM43210', 'medico6@example.com', 6, 'Juliana', 'Rodrigues', '(16) 22222-2222'),
    ('7f5af013-b5d9-4ae2-a7e0-317e343812be', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '222.333.444-55', 'CRM10987', 'medico7@example.com', 7, 'Rafael', 'Ferreira', '(16) 33333-3333'),
    ('a6e8f0ed-5944-4c2c-9fde-df0b3345c086', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '444.555.666-77', 'CRM87654', 'medico8@example.com', 8, 'Carolina', 'Martins', '(16) 44444-4444'),
    ('f79f5a67-fb48-4c68-8805-6746b6677be7', '2023-05-28 16:24:45.739235', '2023-05-28 16:24:45.739235', TRUE, '666.777.888-99', 'CRM65432', 'medico9@example.com', 9, 'Marcelo', 'Rocha', '(16) 55555-5555');
